app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "firstName", "lastName", "phoneNumber", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def show
    if session[:user_id]
        render json: User.find(session[:user_id]), status: :created

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    User.find(params[:id])